Jewelbots/arduino-firmware/jewelbots_firmware_update_v110/boards.txt
JWBFirmware.name=Factory Firmware Update

JWBFirmware.upload.tool=JWBLoader
JWBFirmware.upload.protocol=

JWBFirmware.build.mcu=cortex-m0
JWBFirmware.build.f_cpu=16000000
JWBFirmware.build.board=Jewelbot_v1
JWBFirmware.build.core=Jewelbot_v1
JWBFirmware.build.variant=Jewelbot_v1
JWBFirmware.build.extra_flags=-mthumb
JWBFirmware.build.ldscript=linker_scripts/gcc/JWB_nRF51822.ld
